# Uppgift 2 - KPIer & EDA

Definiera 3-6 KPIer utöver de som använts i ovanstående uppgifter och gör explorativ dataanalys på en eller flera
dataset som ni får söka själva. Ni får inte ta dataseten som ni redan jobbat med i uppgift 0 och 1. Excel och eller csv-filer
kan ni hitta i skolverkets statistik
Se till att dokumentera vad du undersöker med markdown kombinerad med kod i Jupyter notebook eller om du
använder Pythonskript, skriv en markdown vid sidan om. Dokumentera också vad du kommer fram till och spara alla
visualiseringar.

### KPIs - Kostnad per inskrivet barn/elev + Totalts - Förskola, Grundskolan, Specialskola, Grundsärskola, Anpassad Gymnasieskola, Gymnasieskola

file handling

In [550]:
# read the file
import pandas as pd

file_path = "Kostnader_2022_Riket.xlsx"
df = pd.read_excel(file_path, sheet_name='Sheet1', skiprows=7)
df

,Verksamhet,Totalkostnad,Undervisning,Lokaler och inventarier,Skolmåltider,Lärverktyg/ utrustning/ skolbibliotek,Elevhälsa,Övrigt,Skolskjutsar och reseersättning,Noter totalkostnader,Noter lokalkostnader
0,Fritidshem och annan pedagogisk verksamhet,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,"Totalt, tkr",22987642.0,.,.,.,.,.,.,.,NaN,NaN
2,Pedagogisk omsorg,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,"Totalt, tkr",1018481.0,.,.,.,.,.,.,.,NaN,NaN
4,"Kostnad per inskrivet barn, kr",130900.0,.,.,.,.,.,.,.,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
61,2022. Dessutom ingår de 3 896 tkr som avser ne...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
62,per elev ingår inte kostnaden för nystartade/n...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
63,för döva och hörselskadade i Örebro 89 186 tkr.,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
64,10) I totalkostnaden och total kostnad per ele...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
65,utbildningsanordnare (1 748 751 tkr).,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [551]:
# filtering data frame using index for desirable rows and columns
selected_data = df[(df.index >= 14) & (df.index <= 34)][['Verksamhet', 'Totalkostnad']]
selected_data.reset_index(drop=True, inplace=True)
selected_data

                           Verksamhet  Totalkostnad
0                            Förskola           NaN
1                         Totalt, tkr    86536471.0
2      Kostnad per inskrivet barn, kr      169500.0
3                       Förskoleklass           NaN
4                         Totalt, tkr     8780035.0
5                Kostnad per elev, kr       63400.0
6                         Grundskolan           NaN
7                         Totalt, tkr   143016046.0
8                Kostnad per elev, kr      128900.0
9                        Specialskola           NaN
10                        Totalt, tkr      699693.0
11               Kostnad per elev, kr      909200.0
12                      Grundsärskola           NaN
13                        Totalt, tkr     7238691.0
14               Kostnad per elev, kr      546200.0
15             Anpassad gymnasieskola           NaN
16                        Totalt, tkr     3509659.0
17               Kostnad per elev, kr      512100.0
18                     Gymnasieskolan           NaN
19                        Totalt, tkr    48868231.0
20               Kostnad per elev, kr      135100.0

In [552]:
# set index
selected_data.set_index(selected_data.columns[0], inplace=True)
selected_data

                                   Totalkostnad
Verksamhet
Förskola                                    NaN
   Totalt, tkr                       86536471.0
   Kostnad per inskrivet barn, kr      169500.0
Förskoleklass                               NaN
   Totalt, tkr                        8780035.0
   Kostnad per elev, kr                 63400.0
Grundskolan                                 NaN
   Totalt, tkr                      143016046.0
   Kostnad per elev, kr                128900.0
Specialskola                                NaN
   Totalt, tkr                         699693.0
   Kostnad per elev, kr                909200.0
Grundsärskola                               NaN
   Totalt, tkr                        7238691.0
   Kostnad per elev, kr                546200.0
Anpassad gymnasieskola                      NaN
   Totalt, tkr                        3509659.0
   Kostnad per elev, kr                512100.0
Gymnasieskolan                              NaN
   Totalt, tkr                       48868231.0
   Kostnad per elev, kr                135100.0

In [553]:
# rename rows
selected_data.index = selected_data.index.str.strip()
selected_data.rename(index={'Kostnad per inskrivet barn, kr': 'Kostnad per Elev', 'Kostnad per elev, kr': 'Kostnad per Elev'}, inplace=True)
selected_data

                        Totalkostnad
Verksamhet
Förskola                         NaN
Totalt, tkr               86536471.0
Kostnad per Elev            169500.0
Förskoleklass                    NaN
Totalt, tkr                8780035.0
Kostnad per Elev             63400.0
Grundskolan                      NaN
Totalt, tkr              143016046.0
Kostnad per Elev            128900.0
Specialskola                     NaN
Totalt, tkr                 699693.0
Kostnad per Elev            909200.0
Grundsärskola                    NaN
Totalt, tkr                7238691.0
Kostnad per Elev            546200.0
Anpassad gymnasieskola           NaN
Totalt, tkr                3509659.0
Kostnad per Elev            512100.0
Gymnasieskolan                   NaN
Totalt, tkr               48868231.0
Kostnad per Elev            135100.0

In [554]:
# Define new indexes
new_indexes = ['Förskola', 'Förskoleklass', 'Grundskolan', 'Specialskola', 'Grundsärskola', 'Anpassad Gymnasieskola', 'Gymnasieskolan']

# Find the positions of the 'Totalt, tkr' indexes
totalt_positions = [i for i, idx in enumerate(selected_data.index) if idx == 'Totalt, tkr']

# Iterate over the range of the length of new_indexes
for i, idx in zip(totalt_positions, new_indexes):
    selected_data.index.values[i] = idx

selected_data
#

                        Totalkostnad
Verksamhet
Förskola                         NaN
Förskola                  86536471.0
Kostnad per Elev            169500.0
Förskoleklass                    NaN
Förskoleklass              8780035.0
Kostnad per Elev             63400.0
Grundskolan                      NaN
Grundskolan              143016046.0
Kostnad per Elev            128900.0
Specialskola                     NaN
Specialskola                699693.0
Kostnad per Elev            909200.0
Grundsärskola                    NaN
Grundsärskola              7238691.0
Kostnad per Elev            546200.0
Anpassad gymnasieskola           NaN
Anpassad Gymnasieskola     3509659.0
Kostnad per Elev            512100.0
Gymnasieskolan                   NaN
Gymnasieskolan            48868231.0
Kostnad per Elev            135100.0

In [555]:
# drop rows with NaN values

selected_data = selected_data.dropna()

selected_data

                        Totalkostnad
Verksamhet
Förskola                  86536471.0
Kostnad per Elev            169500.0
Förskoleklass              8780035.0
Kostnad per Elev             63400.0
Grundskolan              143016046.0
Kostnad per Elev            128900.0
Specialskola                699693.0
Kostnad per Elev            909200.0
Grundsärskola              7238691.0
Kostnad per Elev            546200.0
Anpassad Gymnasieskola     3509659.0
Kostnad per Elev            512100.0
Gymnasieskolan            48868231.0
Kostnad per Elev            135100.0

In [556]:
# Reset the index
selected_data.reset_index(inplace=True)

# Create a new column "Kostnad per Elev" and fill it with the values where 'Totalkostnad' is not null
selected_data['Kostnad per Elev'] = selected_data[selected_data['Totalkostnad'].notnull()]['Totalkostnad']

selected_data.head()

C:\Users\arthu\AppData\Local\Temp\ipykernel_19408\3362698685.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  selected_data['Kostnad per Elev'] = selected_data[selected_data['Totalkostnad'].notnull()]['Totalkostnad']

         Verksamhet  Totalkostnad  Kostnad per Elev
0          Förskola    86536471.0        86536471.0
1  Kostnad per Elev      169500.0          169500.0
2     Förskoleklass     8780035.0         8780035.0
3  Kostnad per Elev       63400.0           63400.0
4       Grundskolan   143016046.0       143016046.0

In [557]:
# Shift the values of the 'Totalkostnad' column downwards by 1 row
selected_data['Kostnad per Elev'] = selected_data['Totalkostnad'].shift(-1)

selected_data

C:\Users\arthu\AppData\Local\Temp\ipykernel_19408\334379042.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  selected_data['Kostnad per Elev'] = selected_data['Totalkostnad'].shift(-1)

                Verksamhet  Totalkostnad  Kostnad per Elev
0                 Förskola    86536471.0          169500.0
1         Kostnad per Elev      169500.0         8780035.0
2            Förskoleklass     8780035.0           63400.0
3         Kostnad per Elev       63400.0       143016046.0
4              Grundskolan   143016046.0          128900.0
5         Kostnad per Elev      128900.0          699693.0
6             Specialskola      699693.0          909200.0
7         Kostnad per Elev      909200.0         7238691.0
8            Grundsärskola     7238691.0          546200.0
9         Kostnad per Elev      546200.0         3509659.0
10  Anpassad Gymnasieskola     3509659.0          512100.0
11        Kostnad per Elev      512100.0        48868231.0
12          Gymnasieskolan    48868231.0          135100.0
13        Kostnad per Elev      135100.0               NaN

In [558]:
# Filter out rows with value "Kostnad per Elev" in the column "Totalkostnad"
cleaned_df = selected_data[selected_data['Verksamhet'] != 'Kostnad per Elev']

# Reset the index
cleaned_df.reset_index(drop=True, inplace=True)

# Display the cleaned DataFrame
cleaned_df

               Verksamhet  Totalkostnad  Kostnad per Elev
0                Förskola    86536471.0          169500.0
1           Förskoleklass     8780035.0           63400.0
2             Grundskolan   143016046.0          128900.0
3            Specialskola      699693.0          909200.0
4           Grundsärskola     7238691.0          546200.0
5  Anpassad Gymnasieskola     3509659.0          512100.0
6          Gymnasieskolan    48868231.0          135100.0

In [559]:
# Convert values to strings and remove '.0' for better display
cleaned_df['Totalkostnad'] = cleaned_df['Totalkostnad'].astype(str).str[:-2]
cleaned_df['Kostnad per Elev'] = cleaned_df['Kostnad per Elev'].astype(str).str[:-2]

# Add punctuation after every three digits (backwards)
cleaned_df['Totalkostnad'] = cleaned_df['Totalkostnad'].apply(lambda x: '{:,}'.format(int(x))[::-1].replace(',', '.')[::-1])
cleaned_df['Kostnad per Elev'] = cleaned_df['Kostnad per Elev'].apply(lambda x: '{:,}'.format(int(x))[::-1].replace(',', '.')[::-1])

# Rename column
cleaned_df.rename(columns={'Totalkostnad': 'Total Kostnad'}, inplace=True)

cleaned_df

C:\Users\arthu\AppData\Local\Temp\ipykernel_19408\806526262.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cleaned_df['Totalkostnad'] = cleaned_df['Totalkostnad'].astype(str).str[:-2]
C:\Users\arthu\AppData\Local\Temp\ipykernel_19408\806526262.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cleaned_df['Kostnad per Elev'] = cleaned_df['Kostnad per Elev'].astype(str).str[:-2]
C:\Users\arthu\AppData\Local\Temp\ipykernel_19408\806526262.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cleaned_df['Totalkostnad'] = cleaned_df['Totalkostnad'].apply(lambda x: '{:,}'.format(int(x))[::-1].replace(',', '.')[::-1])
C:\Users\arthu\AppData\Local\Temp\ipykernel_19408\806526262.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cleaned_df['Kostnad per Elev'] = cleaned_df['Kostnad per Elev'].apply(lambda x: '{:,}'.format(int(x))[::-1].replace(',', '.')[::-1])
C:\Users\arthu\AppData\Local\Temp\ipykernel_19408\806526262.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cleaned_df.rename(columns={'Totalkostnad': 'Total Kostnad'}, inplace=True)

               Verksamhet Total Kostnad Kostnad per Elev
0                Förskola    86.536.471          169.500
1           Förskoleklass     8.780.035           63.400
2             Grundskolan   143.016.046          128.900
3            Specialskola       699.693          909.200
4           Grundsärskola     7.238.691          546.200
5  Anpassad Gymnasieskola     3.509.659          512.100
6          Gymnasieskolan    48.868.231          135.100